drop table if exists #newtd
select (case when RIGHT(trim([年月]),2) in ('01','02','03') then CONCAT( LEFT(trim([年月]),4),'-01')
		when RIGHT(trim([年月]),2) in ('04','05','06') then CONCAT( LEFT(trim([年月]),4),'-02')
		when RIGHT(trim([年月]),2) in ('07','08','09') then CONCAT( LEFT(trim([年月]),4),'-03')
		when RIGHT(trim([年月]),2) in ('10','11','12') then CONCAT( LEFT(trim([年月]),4),'-04')
		END)AS [季度],

(case when [子车系编码] in  ('J030023001') then '阿特兹'
when [子车系编码] in  ('J008003011') then '亚洲龙'
when [子车系编码] in  ('J009003007') then '凯美瑞'
when [子车系编码] in  ('J011002010') then '雅阁'
when [子车系编码] in  ('J012002001') then 'INSPIRE'
when [子车系编码] in  ('J001006011') then '君威'
when [子车系编码] in  ('J001006012') then '君越'
when [子车系编码] in  ('J023019011','J023019013') then '蒙迪欧'
when [子车系编码] in  ('J002001013','J002001015') then '帕萨特'
when [子车系编码] in  ('J052001011','J003001009') then '迈腾'
when [子车系编码] in  ('J005005007') then '天籁'

when [子车系编码] in  ('J027023003','J027023004') then '马自达3昂克赛拉'
when [子车系编码] in  ('J008003018','J008003022','J008003005') then '卡罗拉'
when [子车系编码] in  ('J009003008') then '雷凌'
when [子车系编码] in  ('J179002002','J012002011','J012002010') then '思域'
when [子车系编码] in  ('J011002015','J011002012') then '型格'
when [子车系编码] in  ('J023019006') then '福睿斯'
when [子车系编码] in  ('J005005011','J005005013') then '轩逸'
when [子车系编码] in  ('J002001006','J002001008','J002001009','J002001010','J002001011','J002001034') then '朗逸'
when [子车系编码] in  ('J003001019','J003001002') then '宝来'
when [子车系编码] in  ('J001006022') then '威朗Pro'
when [子车系编码] in  ('J022020009','J022020006') then '起亚K3'

when [子车系编码] in  ('J027023007') then '马自达CX-30'
when [子车系编码] in  ('J009003004') then '丰田C-HR'
when [子车系编码] in  ('J008003013') then '奕泽IZOA'
when [子车系编码] in  ('J012002005') then '本田XR-V'
when [子车系编码] in  ('J011002002') then '缤智'
when [子车系编码] in  ('J003001001') then 'T-ROC探歌'
when [子车系编码] in  ('J005005009') then '逍客'
when [子车系编码] in  ('J022020016') then '起亚KX3'

when [子车系编码] in  ('J027023008') then '马自达CX-5'
when [子车系编码] in  ('J008003001') then 'RAV4荣放'
when [子车系编码] in  ('J009003010') then '威兰达'
when [子车系编码] in  ('J012002003') then '本田CR-V'
when [子车系编码] in  ('J011002008') then '皓影'
when [子车系编码] in  ('J005005005','J005005018') then '奇骏'
when [子车系编码] in  ('J002001024','J002001023') then '途观L'
when [子车系编码] in  ('J003001013') then '探岳'
when [子车系编码] in  ('J023019014') then '锐际'
when [子车系编码] in  ('J015009027','J015009017') then '途胜L'
end) as [子车系],

[tp], [销量]

into #newtd

from [LandRoadsGZ].[dbo].[fact_JLL_终端价格销量] 


where [子车系编码] in ('J030023001',	'J008003011',	'J009003007',	'J011002010',	'J012002001',	'J001006011',	'J001006012',	'J023019011',	'J023019013',	'J002001013',	'J002001015',	'J052001011',	'J003001009',	'J005005007',
'J027023003',	'J008003018',	'J009003008',	'J179002002',	'J011002015',	'J023019006',	'J005005011',	'J002001006',	'J003001019',	'J001006022',	'J022020009',	'J027023004',	'J008003022',	'J012002011',	'J011002012',	'J005005013',	'J002001008',	'J003001002',	'J022020006',	'J008003005',	'J012002010',	'J002001009',	'J002001010',	'J002001011',	'J002001034',
'J027023007',	'J009003004',	'J008003013',	'J012002005',	'J011002002',	'J003001001',	'J005005009',	'J022020016',
'J027023008',	'J008003001',	'J009003010',	'J012002003',	'J011002008',	'J005005005',	'J002001024',	'J003001013',	'J023019014',	'J015009027',	'J005005018',	'J002001023',	'J015009017')

and trim([年月])>= '2016-01' and trim([年月]) < '2023-12'


--select *  from #newtd


select a.[季度],a.[子车系],
sum(a.[销量])as 销量,
round(sum(a.[销量*mix]),-2) as 加权TP
from 

(
	select  [季度],[子车系],[tp], [销量],

					(
						CONVERT(decimal,[tp])*(CASE WHEN CONVERT(decimal,[销量])=0 THEN 0.0000001 ELSE CONVERT(decimal,[销量]) END )/
						sum((CASE WHEN CONVERT(decimal,[销量])=0 THEN 0.0000001 ELSE CONVERT(decimal,[销量]) END )) over(partition by [季度],[子车系])
					) as [销量*mix]

	from #newtd

)a

group by [季度],[子车系]
order  by  [季度],[子车系];