
select a.[季度], a.[品牌],a.[子车系],a.[汽车类别],
sum(a.[销量])as 销量,
round(sum(a.[销量*mix]),-2) as 加权TP
from 
(

		select [车型编码],

		(case when RIGHT(trim([年月]),2) in ('01','02','03') then CONCAT( LEFT(trim([年月]),4),'-01')
		when RIGHT(trim([年月]),2) in ('04','05','06') then CONCAT( LEFT(trim([年月]),4),'-02')
		when RIGHT(trim([年月]),2) in ('07','08','09') then CONCAT( LEFT(trim([年月]),4),'-03')
		when RIGHT(trim([年月]),2) in ('10','11','12') then CONCAT( LEFT(trim([年月]),4),'-04')
		END)AS [季度],

		[品牌],[子车系],[汽车类别],[tp], [销量],


				(
					CONVERT(decimal,[tp])*(CASE WHEN CONVERT(decimal,[销量])=0 THEN 0.0000001 ELSE CONVERT(decimal,[销量]) END )/
					sum((CASE WHEN CONVERT(decimal,[销量])=0 THEN 0.0000001 ELSE CONVERT(decimal,[销量]) END )) over(partition by left(trim([年月]),4),(cast(right(trim([年月]),2) as int)-1)/3, [品牌],[子车系],[汽车类别])
				) AS [销量*mix]

		from [LandRoadsGZ].[dbo].[fact_JLL_终端价格销量] 

		where [子车系编码] in ('J030023001',	'J008003011',	'J009003007',	'J011002010',	'J012002001',	'J001006011',	'J001006012',	'J023019011',	'J023019013',	'J002001013',	'J002001015',	'J052001011',	'J003001009',	'J005005007',
		'J027023003',	'J008003018',	'J009003008',	'J179002002',	'J011002015',	'J023019006',	'J005005011',	'J002001006',	'J003001019',	'J001006022',	'J022020009',	'J027023004',	'J008003022',	'J012002011',	'J011002012',	'J005005013',	'J002001008',	'J003001002',	'J022020006',	'J008003005',	'J012002010',	'J002001009',	'J002001010',	'J002001011',	'J002001034',
		'J027023007',	'J009003004',	'J008003013',	'J012002005',	'J011002002',	'J003001001',	'J005005009',	'J022020016',
		'J027023008',	'J008003001',	'J009003010',	'J012002003',	'J011002008',	'J005005005',	'J002001024',	'J003001013',	'J023019014',	'J015009027',	'J005005018',	'J002001023',	'J015009017')

		and trim([年月])>= '2016-01' and trim([年月]) < '2023-12'

)a

group by [季度], [品牌],[子车系],[汽车类别]

order  by  [季度], [品牌],[子车系],[汽车类别];


