

drop table if exists #newtd

select [年月],
(case when [子车系编码] in ('J077050001','J018018020',	'J004201001',	'J048072005',	'J018018058',	'J067088002',	'J008003021',	'J093121004',	'J067088003',	'J079222001',	'J016195004',	'J010071007',	'J048072008',	'J047130003',	'J070093004') then '纯电轿车'
when [子车系编码] in  ('J008003019',	'J093121003',	'J079222004',	'J067088006',	'J018018049',	'J001006025',	'J047130001',	'J029050002',	'J108215003',	'J048072002',	'J212224001',	'J089107005',	'J018018041',	'J201207001',	'J048072006') then '纯电SUV'
when [子车系编码] in  ('J018018057',	'J079222002',	'J070093005',	'J003001010',	'J002001014',	'J018018062',	'J011002016',	'J217231001',	'J012002017',	'J093121005') then '插混及增程轿车'
when [子车系编码] in  ('J018018046',	'J093121003',	'J079222003',	'J007013030',	'J003001014',	'J018018050',	'J108215001',	'J002001025')then '插混和增程SUV'
end) as [细分市场]

,[tp], [销量],[MSRP]

into #newtd

from [LandRoadsGZ].[dbo].[fact_JLL_终端价格销量] 


where  trim([年月])>= '2019-12' and trim([年月]) < '2023-10'

and [子车系编码] in ('J077050001','J018018020',	'J004201001',	'J048072005',	'J018018058',	'J067088002',	'J008003021',	'J093121004',	'J067088003',	'J079222001',	'J016195004',	'J010071007',	'J048072008',	'J047130003',	'J070093004'
,'J008003019',	'J093121003',	'J079222004',	'J067088006',	'J018018049',	'J001006025',	'J047130001',	'J029050002',	'J108215003',	'J048072002',	'J212224001',	'J089107005',	'J018018041',	'J201207001',	'J048072006'
,'J018018057',	'J079222002',	'J070093005',	'J003001010',	'J002001014',	'J018018062',	'J011002016',	'J217231001',	'J012002017',	'J093121005'
,'J018018046',	'J093121003',	'J079222003',	'J007013030',	'J003001014',	'J018018050',	'J108215001',	'J002001025'
)


--select *  from #newtd


select a.[年月],a.[细分市场],
round(sum(a.[tp*销量*mix]),-2) as 加权TP,
round(sum(a.[MSRP*销量*mix]),-2) as 加权MSRP
from 

(
	select  [年月],[细分市场],[tp], [销量],[MSRP],

	(
		CONVERT(decimal,[tp])*(CASE WHEN CONVERT(decimal,[销量])=0 THEN 0.0000001 ELSE CONVERT(decimal,[销量]) END )/
		sum((CASE WHEN CONVERT(decimal,[销量])=0 THEN 0.0000001 ELSE CONVERT(decimal,[销量]) END )) over(partition by [年月],[细分市场])
	) as [tp*销量*mix],
		(
		CONVERT(decimal,[MSRP])*(CASE WHEN CONVERT(decimal,[销量])=0 THEN 0.0000001 ELSE CONVERT(decimal,[销量]) END )/
		sum((CASE WHEN CONVERT(decimal,[销量])=0 THEN 0.0000001 ELSE CONVERT(decimal,[销量]) END )) over(partition by [年月],[细分市场])
	) as [MSRP*销量*mix]

	from #newtd

)a

group by a.[年月],a.[细分市场]
order  by  a.[年月],a.[细分市场];










drop table if exists #newtd_year

select left([年月],4) as [年度],

(case when [子车系编码] in ('J077050001','J018018020',	'J004201001',	'J048072005',	'J018018058',	'J067088002',	'J008003021',	'J093121004',	'J067088003',	'J079222001',	'J016195004',	'J010071007',	'J048072008',	'J047130003',	'J070093004') then '纯电轿车'
when [子车系编码] in  ('J008003019',	'J093121003',	'J079222004',	'J067088006',	'J018018049',	'J001006025',	'J047130001',	'J029050002',	'J108215003',	'J048072002',	'J212224001',	'J089107005',	'J018018041',	'J201207001',	'J048072006') then '纯电SUV'
when [子车系编码] in  ('J018018057',	'J079222002',	'J070093005',	'J003001010',	'J002001014',	'J018018062',	'J011002016',	'J217231001',	'J012002017',	'J093121005') then '插混及增程轿车'
when [子车系编码] in  ('J018018046',	'J093121003',	'J079222003',	'J007013030',	'J003001014',	'J018018050',	'J108215001',	'J002001025') then '插混和增程SUV'
end) as [细分市场]

,[tp], [销量],[MSRP]

into #newtd_year

from [LandRoadsGZ].[dbo].[fact_JLL_终端价格销量] 


where  trim([年月])>= '2019-12' and trim([年月]) < '2023-10'

and [子车系编码] in ('J077050001','J018018020',	'J004201001',	'J048072005',	'J018018058',	'J067088002',	'J008003021',	'J093121004',	'J067088003',	'J079222001',	'J016195004',	'J010071007',	'J048072008',	'J047130003',	'J070093004'
,'J008003019',	'J093121003',	'J079222004',	'J067088006',	'J018018049',	'J001006025',	'J047130001',	'J029050002',	'J108215003',	'J048072002',	'J212224001',	'J089107005',	'J018018041',	'J201207001',	'J048072006'
,'J018018057',	'J079222002',	'J070093005',	'J003001010',	'J002001014',	'J018018062',	'J011002016',	'J217231001',	'J012002017',	'J093121005'
,'J018018046',	'J093121003',	'J079222003',	'J007013030',	'J003001014',	'J018018050',	'J108215001',	'J002001025'
)


--select *  from #newtd_year


select a.[年度],a.[细分市场],
round(sum(a.[tp*销量*mix]),-2) as 加权TP,
round(sum(a.[MSRP*销量*mix]),-2) as 加权MSRP
from 

(
	select  [年度],[细分市场],[tp], [销量],[MSRP],

	(
		CONVERT(decimal,[tp])*(CASE WHEN CONVERT(decimal,[销量])=0 THEN 0.0000001 ELSE CONVERT(decimal,[销量]) END )/
		sum((CASE WHEN CONVERT(decimal,[销量])=0 THEN 0.0000001 ELSE CONVERT(decimal,[销量]) END )) over(partition by [年度],[细分市场])
	) as [tp*销量*mix],

	(
		CONVERT(decimal,[MSRP])*(CASE WHEN CONVERT(decimal,[销量])=0 THEN 0.0000001 ELSE CONVERT(decimal,[销量]) END )/
		sum((CASE WHEN CONVERT(decimal,[销量])=0 THEN 0.0000001 ELSE CONVERT(decimal,[销量]) END )) over(partition by [年度],[细分市场])
	) as [MSRP*销量*mix]

	from #newtd_year

)a

group by a.[年度],a.[细分市场]
order  by  a.[年度],a.[细分市场];